Catalogs/ПоказателиВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПоказателиВиджетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияВиджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ДействияВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДействияВиджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НичегоНеДелать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытьФормуСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходПоСсылке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитьАлгоритм</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПоказателиВиджетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	Шрифт = РеквизитОбъект.Шрифт.Получить();
	Если Шрифт = Неопределено Тогда
		Шрифт = ШрифтыСтиля.ОбычныйШрифтТекста;
	КонецЕсли;
	
	ЗаполнитьИсточник();
	ОбновитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Шрифт = Новый ХранилищеЗначения(Шрифт);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	
	Объект.Источник = "";
	ОбновитьДоступностьЭлементов();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИсточник()
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Метаданные.Справочники);
	МассивТипов.Добавить(Метаданные.Документы);
	МассивТипов.Добавить(Метаданные.ЖурналыДокументов);
	МассивТипов.Добавить(Метаданные.РегистрыСведений);
	МассивТипов.Добавить(Метаданные.РегистрыНакопления);
	
	Для Каждого ТипМетаданных Из МассивТипов Цикл
		Для Каждого ОчередныеМетаданные Из Метаданные.Справочники Цикл
			Элементы.Источник.СписокВыбора.Добавить(ОчередныеМетаданные.ПолноеИмя());
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьЭлементов()
	
	Элементы.Источник.Доступность = (Объект.Действие = Перечисления.ДействияВиджетов.ОткрытьФормуСписка);
	Элементы.АлгоритмДействия.Доступность = (Объект.Действие = Перечисления.ДействияВиджетов.ВыполнитьАлгоритм);
	
КонецПроцедуры

#КонецОбласти
